#!/bin/bash

#Задание 1(10).
#Вывести дату 01.01.N + M часов, N -номер года. N,M передаются параметрами. Вывод в формате 2013-03-28 13:00:00, Mon.
#
#Как запускать:
#chmod +x Task_1.sh
#./Task_1.sh

year="$1"
time="$2"

if [[ year -eq NULL || time -eq NULL ]] ; 
  then 
    echo "--=== Параметры не переданы. Завершение сценария. ===--"
    exit 0; 
fi;

echo "Начальная дата: "$(date --date="$year-01-01" +%Y-%m-%d" "$time:%M:%S," "%a)
echo "Конечная дата:  "$(date --date="$year-01-01 $time hour" +%Y-%m-%d" "%H:%M:%S," "%a);
echo "--=== Сценарий успешно выполнен. ===--"

 
